/*
 * $Id: mlswitch.c,v 1.44.2.4 Broadcom SDK $
 *
 * $Copyright: Copyright 2016 Broadcom Corporation.
 * This program is the proprietary software of Broadcom Corporation
 * and/or its licensors, and may only be used, duplicated, modified
 * or distributed pursuant to the terms and conditions of a separate,
 * written license agreement executed between you and Broadcom
 * (an "Authorized License").  Except as set forth in an Authorized
 * License, Broadcom grants no license (express or implied), right
 * to use, or waiver of any kind with respect to the Software, and
 * Broadcom expressly reserves all rights in and to the Software
 * and all intellectual property rights therein.  IF YOU HAVE
 * NO AUTHORIZED LICENSE, THEN YOU HAVE NO RIGHT TO USE THIS SOFTWARE
 * IN ANY WAY, AND SHOULD IMMEDIATELY NOTIFY BROADCOM AND DISCONTINUE
 * ALL USE OF THE SOFTWARE.  
 *  
 * Except as expressly set forth in the Authorized License,
 *  
 * 1.     This program, including its structure, sequence and organization,
 * constitutes the valuable trade secrets of Broadcom, and you shall use
 * all reasonable efforts to protect the confidentiality thereof,
 * and to use this information only in connection with your use of
 * Broadcom integrated circuit products.
 *  
 * 2.     TO THE MAXIMUM EXTENT PERMITTED BY LAW, THE SOFTWARE IS
 * PROVIDED "AS IS" AND WITH ALL FAULTS AND BROADCOM MAKES NO PROMISES,
 * REPRESENTATIONS OR WARRANTIES, EITHER EXPRESS, IMPLIED, STATUTORY,

     * Set reference clock (based on 200MHz core clock)
     * to be 200MHz * (1/40) = 5MHz
     */
    WRITECSR(CMIC_RATE_ADJUST_EXT_MDIO, 0x10028);
    /* Match the Internal MDC freq with above for External MDC */
    WRITECSR(CMIC_RATE_ADJUST_INT_MDIO, 0x10028);
}

static void
soc_mmu_tdm_init(uint8 unit){
    int i;
    uint32 val;
    int tdm_size;
    const uint32 *arr = NULL;
    uint32 port_enable_value=0;

    switch (ml_sw_info.devid) {
        case BCM53460_DEVICE_ID:
        case BCM56270_DEVICE_ID:
            tdm_size = ML_TDM_A_SIZE;
            arr = ml_tdm_56270_A_ref;
        break;
        case BCM53461_DEVICE_ID:
        case BCM56271_DEVICE_ID:
            tdm_size = ML_TDM_C_SIZE;
            arr = ml_tdm_56271_C_ref;
        break;
    }

    /* Disable IARB TDM before programming... */
    /* DISABLE [Bit 0] = 1, TDM_WRAP_PTR[Bit 9:1] = TDM_SIZE-1 */
    bcm5346x_reg_get(0, R_IARB_TDM_CONTROL, &val);
    val &= ~0x3FF;
    val |= (((tdm_size-1) << 1) | 1);
    bcm5346x_reg_set(0, R_IARB_TDM_CONTROL, val);

    for (i = 0; i < tdm_size; i++) {
        if (arr[i] < ML_IDLE) { /* Non Idle Slots */
            port_enable_value = 1;
        } else {
            port_enable_value = 0;
        }
          
        bcm5346x_mem_set(unit, M_IARB_TDM_TABLE(i), (uint32 *)&arr[i], 1);

        if((i % 2) == 0) {
            /* Two entries per mem entry */
            /* port_id_0_enable [Bit 9], port_id_0 [Bit 8:5] */
            val = (((arr[i] & 0x1f) << 5) | (port_enable_value << 9));
        } else {
            /* port_id_1_enable [Bit 4], port_id_1 [Bit 3:0] */
            val |= (((arr[i] & 0x1f) << 0) | (port_enable_value << 4));
            bcm5346x_mem_set(unit, M_LLS_PORT_TDM(i/2), &val, 1);
        }
    }

    if (tdm_size % 2) {
        sal_printf("Info:Odd TDM Size%d \n",tdm_size);
        bcm5346x_mem_set(unit, M_LLS_PORT_TDM(i/2), &val, 1);
    }

    /* DISABLE [Bit 0] = 0, TDM_WRAP_PTR[Bit 9:1] = TDM_SIZE-1, IDLE_PORT_NUM_SEL[Bit 10] = 1*/
    bcm5346x_reg_get(0, R_IARB_TDM_CONTROL, &val);
    val &= ~0x7FF;
    val |= ((tdm_size-1) << 1) | (1 << 10);
    bcm5346x_reg_set(unit, R_IARB_TDM_CONTROL, val);

    /* END_B [Bit 8:0] = TDM_SIZE-1, END_A[Bit 17:9] = TDM_SIZE-1, ENABLE[Bit 25] = 1*/
    val = ((tdm_size-1) << 0) | ((tdm_size-1) << 9) | (1 << 25);
    bcm5346x_reg_set(unit, R_LLS_TDM_CAL_CFG, val);
}

/* *************************************************************** */
/* MetroLiteMMU HELPER  --- START(As per Metrolite_MMU_Settings.xls */
/* *************************************************************** */
const static uint32 ml_port_mapping[BCM5346X_LPORT_MAX + 2][2] =
{ {0,0}, {1,15}, {2,23}, {3, 31}, {4, 39}, {5,47}, {6, 55},
  {7,63}, {8, 71}, {9, 79}, {21, 175}, {22, 183}, {23, 191}, {29,239}};

#define ML_GET_THDI_PORT(p) ml_port_mapping[p][0]
#define ML_GET_THDI_PORT_PG(p) ml_port_mapping[p][1]
#define RQEI_QUEUE_SIZE 12
#define RDEI_QUEUE_SIZE 8
#define RDEQ_QUEUE_SIZE 8
#define OTHER_QUEUE_SIZE 12

/* Dynamic/SetLater Parameter */
typedef struct _soc_ml_mmu_params {
    uint32 mmu_min_pkt_size;                   /*C5*/
    uint32 mmu_ethernet_mtu_bytes;             /*C6*/
    uint32 mmu_max_pkt_size;                   /*C7*/
    uint32 mmu_jumbo_frame_size;               /*C8*/
    uint32 mmu_int_buf_cell_size;              /*C9*/
    uint32 mmu_pkt_header_size;                /*C10*/
    uint32 lossless_mode_d_c;                  /*C11*/
    uint32 pfc_pause_mode_d_c;                 /*C12*/
    uint32 mmu_lossless_pg_num;                /*C13*/
    uint32 num_ge_ports_d;                     /*C14*/
    uint32 mmu_line_rate_ge;                   /*C15*/
    uint32 num_ge_int_ports_d;                 /*C14*/
    uint32 num_egr_queue_per_int_ge_port_d;    /*C16*/
    uint32 num_hg_ports_d;                     /*C17*/
    uint32 mmu_line_rate_hg;                   /*C18*/
    uint32 num_hg_int_ports_d;                 /*C17*/
    uint32 num_egr_queue_per_int_hg_port_d;    /*C19 */
    uint32 mmu_num_cpu_port;                   /*C20*/
    uint32 mmu_num_cpu_queue;                  /*C21*/
    uint32 mmu_num_loopback_port;              /*C22*/
    uint32 mmu_num_loopback_queue;             /*C35*/
    uint32 mmu_num_ep_redirection_queue;       /*C36*/
    uint32 mmu_num_olp_port_d;                 /*C37*/
    uint32 mmu_num_olp_queue;                  /*C38*/
    uint32 olp_port_int_ext_bounding_d_c;      /*C39:Dynamic*/
    uint32 mmu_total_egress_queue;             /*C40*/
    uint32 mmu_pipeline_lat_cpap_admission;    /*C41*/
    uint32 mmu_int_buf_size;                   /*C42:2048KB=2MB*/
    uint32 mmu_available_int_buf_size_d;       /*C43:1434KB */
    uint32 mmu_reserved_int_buf_cells;         /*C44:100 Cells */
    uint32 mmu_reserved_int_buf_ema_pool_size_d; /*C45:614KB */
    uint32 internal_buffer_reduction_d_c;        /* C46:Dynamic */
    uint32 mmu_ext_buf_size;                   /*C47:737280KB=720MB*/
    uint32 mmu_reserved_ext_buf_space_cfap;    /*C48:737280KB=720MB*/
    uint32 mmu_egress_queue_entries;           /*C49*/
    uint32 mmu_ep_redirect_queue_entries;      /*C50*/
    uint32 mmu_exp_num_of_repl_per_pkt;        /*C51*/
    uint32 mmu_repl_engine_work_queue_entries; /*C52*/
    uint32 mmu_resv_repl_engine_work_queue_entries; /*C53*/
    uint32 mmu_repl_engine_work_queue_in_device;/*C54*/
    uint32 mmu_ema_queues;                     /*C55*/
    uint32 num_cells_rsrvd_ing_ext_buf;        /* C56:Dynamic */
    uint32 per_cos_res_cells_for_int_buff_d;   /* C58:Dynamic */
    uint32 per_cos_res_cells_for_ext_buff_d;   /* C59:Dynamic */
    uint32 mmu_ing_port_dyn_thd_param;         /*C60*/
    uint32 mmu_ing_pg_dyn_thd_param;           /*C61*/
    uint32 mmu_egr_queue_dyn_thd_param_baf;        /*C62*/
    uint32 mmu_egr_queue_dyn_thd_param_baf_profile_lossy;           /*C63*/
    uint32 mmu_ing_cell_buf_reduction;         /*C64 */
    uint32 mmu_ing_pkt_buf_reduction;          /*C65 */
} _soc_ml_mmu_params_t;

typedef struct _general_info {
    uint32 max_packet_size_in_cells;                         /* C72 */
    uint32 jumbo_frame_for_int_buff;                         /* C73 */
    uint32 jumbo_frame_for_ext_buff;                         /* C74 */
    uint32 ether_mtu_cells_for_int_buff;                     /* C76 */
    uint32 ether_mtu_cells_for_ext_buff;                     /* C77 */
    uint32 total_num_of_ports;                               /* C79 */
    uint32 total_num_of_ports_excl_lpbk;                     /* C80 */
    uint32 total_num_of_ports_excl_lpbk_olp;                 /* C81 */
    uint32 total_num_of_ports_excl_lpbk_olp_cpu;             /* C82 */
    uint32 port_bw_bound_to_ext_buff;                        /* C83 */
    uint32 total_egr_queues_for_a_int_ge_ports;              /* C84 */
    uint32 total_egr_queues_for_a_ext_ge_ports;              /* C85 */
    uint32 total_egr_queues_for_a_int_hg_ports;              /* C86 */
    uint32 total_egr_queues_for_a_ext_hg_ports;              /* C87 */
    uint32 total_cpu_queues;                                 /* C88 */
    uint32 total_base_queue_int_buff;                       /* C89 */
    uint32 total_base_queue_ext_buff;                        /* C90 */
    uint32 total_ema_queues;                                 /* C91 */
    uint32 total_egr_base_queues_in_device;                  /* C93 */
    uint32 total_egr_queues_in_device;                       /* C94 */
    uint32 max_int_cell_buff_size;                           /* C95 */
    uint32 int_cell_buff_size_after_limitation;              /* C96 */
    uint32 src_packing_fifo;                                 /* C97 */
    uint32 int_buff_pool;                                    /* C98 */
    uint32 ema_pool;                                         /* C99 */
    uint32 max_ext_cell_buff_size;                           /* C100 */
    uint32 repl_engine_work_queue_entries;                   /* C101 */
    uint32 ratio_of_ext_buff_to_int_buff_size;               /* C103 */
    uint32 int_buff_cells_per_avg_size_pkt;                  /* C104 */
    uint32 ext_buff_cells_per_avg_size_pkt;                  /* C105 */
    uint32 max_prop_of_buff_used_by_one_queue_port;          /* C106 */
}_general_info_t;

typedef struct _input_port_threshold_t {
    uint32 global_hdrm_cells_for_int_buff_ingress_pool;      /* C110 */
    uint32 global_hdrm_cells_for_int_buff_ema_pool;          /* C111 */
    uint32 global_hdrm_cells_for_ext_buff_pool;              /* C112 */
    uint32 global_hdrm_cells_for_RE_WQEs;                    /* C113 */
    uint32 global_hdrm_cells_for_EQEs;                       /* C114 */

    uint32 hdrm_int_buff_cells_for_10G_PG;                   /* C115 */
    uint32 hdrm_ema_buff_cells_for_10G_PG;                   /* C116 */
    uint32 hdrm_ext_buff_cells_for_10G_PG;                   /* C117 */
    uint32 hdrm_RE_WQEs_pkts_for_10G_PG;                     /* C118 */
    uint32 hdrm_EQEs_pkts_for_10G_PG;                        /* C119 */

    uint32 hdrm_int_buff_cells_for_10G_total_PG;             /* C120 */
    uint32 hdrm_ema_buff_cells_for_10G_total_PG;             /* C121 */
    uint32 hdrm_ext_buff_cells_for_10G_total_PG;             /* C122 */
    uint32 hdrm_RE_WQEs_pkts_for_10G_total_PG;               /* C123 */
    uint32 hdrm_EQEs_pkts_for_10G_total_PG;                  /* C124 */

    uint32 hdrm_int_buff_cells_for_1G_PG;                    /* C125 */
    uint32 hdrm_ema_buff_cells_for_1G_PG;                    /* C126 */
    uint32 hdrm_ext_buff_cells_for_1G_PG;                    /* C127 */
    uint32 hdrm_RE_WQEs_pkts_for_1G_PG;                      /* C128 */
    uint32 hdrm_EQEs_pkts_for_1G_PG;                         /* C129 */

    uint32 hdrm_int_buff_cells_for_1G_total_PG;              /* C130 */
    uint32 hdrm_ema_buff_cells_for_1G_total_PG;              /* C131 */
    uint32 hdrm_ext_buff_cells_for_1G_total_PG;              /* C132 */
    uint32 hdrm_RE_WQEs_pkts_for_1G_total_PG;                /* C133 */
    uint32 hdrm_EQEs_pkts_for_1G_total_PG;                   /* C134 */

    uint32 hdrm_int_buff_cells_for_olp_port;                 /* C135 */
    uint32 hdrm_ema_buff_cells_for_olp_port;                 /* C136 */
    uint32 hdrm_ext_buff_cells_for_olp_port;                 /* C137 */
    uint32 hdrm_RE_WQEs_pkts_for_olp_port;                   /* C138 */
    uint32 hdrm_EQEs_pkts_for_olp_port;                      /* C139 */

    uint32 hdrm_int_buff_cells_for_lpbk_port;                /* C140 */
    uint32 hdrm_ema_buff_cells_for_lpbk_port;                /* C141 */
    uint32 hdrm_ext_buff_cells_for_lpbk_port;                /* C142 */
    uint32 hdrm_RE_WQEs_pkts_for_lpbk_port;                  /* C143 */
    uint32 hdrm_EQEs_pkts_for_lpbk_port;                     /* C144 */

    uint32 hdrm_int_buff_cells_for_cpu_port;                 /* C145 */
    uint32 hdrm_ema_buff_cells_for_cpu_port;                 /* C146 */
    uint32 hdrm_ext_buff_cells_for_cpu_port;                 /* C147 */
    uint32 hdrm_RE_WQEs_pkts_for_cpu_port;                   /* C148 */
    uint32 hdrm_EQEs_pkts_for_cpu_port;                      /* C149 */

    uint32 total_hdrm_int_buff_cells;                        /* C150 */
    uint32 total_hdrm_int_buff_ema_pool_cells;               /* C151 */
    uint32 total_hdrm_ext_buff_cells;                        /* C152 */
    uint32 total_hdrm_RE_WQEs_pkts;                          /* C153 */
    uint32 total_hdrm_EQEs_pkts;                             /* C154 */

    uint32 min_int_buff_cells_per_PG;                        /* C156 */
    uint32 min_int_buff_ema_pool_cells_per_PG;               /* C157 */
    uint32 min_ext_buff_cells_per_PG;                        /* C158 */
    uint32 min_RE_WQEs_pkt_per_PG;                           /* C159 */
    uint32 min_EQEs_pkt_per_PG;                              /* C160 */

    uint32 min_int_buff_cells_for_total_PG;                  /* C162 */
    uint32 min_int_buff_ema_pool_cells_for_total_PG;         /* C163 */
    uint32 min_ext_buff_cells_for_total_PG;                  /* C164 */
    uint32 min_RE_WQEs_pkts_for_total_PG;                    /* C165 */
    uint32 min_EQEs_pkts_for_total_PG;                       /* C166 */

    uint32 min_int_buff_cells_for_a_port;                    /* C168 */
    uint32 min_int_buff_ema_pool_cells_for_a_port;           /* C169 */
    uint32 min_ext_buff_cells_for_a_port;                    /* C170 */
    uint32 min_RE_WQEs_pkts_for_a_port;                      /* C171 */
    uint32 min_EQEs_pkts_for_a_port;                         /* C172 */

    uint32 min_int_buff_cells_for_total_port;                /* C174 */
    uint32 min_int_buff_ema_pool_cells_for_total_port;       /* C175 */
    uint32 min_ext_buff_cells_for_total_port;                /* C176 */
    uint32 min_RE_WQEs_pkts_for_total_port;                  /* C177 */
    uint32 min_EQEs_pkts_for_total_port;                     /* C178 */

    uint32 total_min_int_buff_cells;                         /* C180 */
    uint32 total_min_int_buff_ema_pool_cells;                /* C181 */
    uint32 total_min_ext_buff_cells;                         /* C182 */
    uint32 total_min_RE_WQEs_pkts;                           /* C183 */
    uint32 total_min_EQEs_pkts;                              /* C184 */

    uint32 total_shared_ing_buff_pool;                       /* C186 */
    uint32 total_shared_EMA_buff;                            /* C187 */
    uint32 total_shared_ext_buff;                            /* C188 */
    uint32 total_shared_RE_WQEs_buff;                        /* C189 */
    uint32 total_shared_EQEs_buff;                           /* C190 */

    uint32 ingress_burst_cells_size_for_one_port;            /* C192 */
    uint32 ingress_burst_pkts_size_for_one_port;             /* C193 */
    uint32 ingress_burst_cells_size_for_all_ports;           /* C194 */
    uint32 ingress_total_shared_cells_use_for_all_port;      /* C195 */
    uint32 ingress_burst_pkts_size_for_all_port;             /* C196 */
    uint32 ingress_total_shared_pkts_use_for_all_port;       /* C197 */
    uint32 ingress_total_shared_hdrm_cells_use_for_all_port; /* C198 */
    uint32 ingress_total_shared_hdrm_pkts_use_for_all_port;  /* C199 */

}_input_port_threshold_t;

typedef struct _output_port_threshold_t {
    uint32 min_grntd_res_queue_cells_int_buff;               /* C204 */
    uint32 min_grntd_res_queue_cells_ext_buff;               /* C205 */
    uint32 min_grntd_res_queue_cells_EQEs;                   /* C206 */
    uint32 min_grntd_res_EMA_queue_cells;                    /* C207 */
    uint32 min_grntd_res_RE_WQs_cells;                       /* C208 */
    uint32 min_grntd_res_RE_WQs_queue_cells_for_int_buff;    /* C209 */
    uint32 min_grntd_res_RE_WQs_queue_cells_for_ext_buff;    /* C210 */
    uint32 min_grntd_res_EP_redirect_queue_entry_cells;      /* C211 */

    uint32 min_grntd_tot_res_queue_cells_int_buff;           /* C213 */
    uint32 min_grntd_tot_res_queue_cells_ext_buff;           /* C214 */
    uint32 min_grntd_tot_res_queue_cells_EQEs;               /* C215 */
    uint32 min_grntd_tot_res_EMA_queue_cells;                /* C216 */
    uint32 min_grntd_tot_res_RE_WQs_cells;                   /* C217 */
    uint32 min_grntd_tot_res_RE_WQs_queue_cells_for_int_buff;/* C218 */
    uint32 min_grntd_tot_res_RE_WQs_queue_cells_for_ext_buff;/* C219 */
    uint32 min_grntd_tot_res_EP_redirect_queue_entry_cells;  /* C220 */

    uint32 min_grntd_tot_shr_queue_cells_int_buff;           /* C222 */
    uint32 min_grntd_tot_shr_queue_cells_ext_buff;           /* C223 */
    uint32 min_grntd_tot_shr_queue_cells_EQEs;               /* C224 */
    uint32 min_grntd_tot_shr_EMA_queue_cells;                /* C225 */
    uint32 min_grntd_tot_shr_RE_WQs_cells;                   /* C226 */
    uint32 min_grntd_tot_shr_RE_WQs_queue_cells_for_int_buff;/* C227 */
    uint32 min_grntd_tot_shr_RE_WQs_queue_cells_for_ext_buff;/* C228 */
    uint32 min_grntd_tot_shr_EP_redirect_queue_entry_cells;  /* C229 */

    uint32 egress_queue_dynamic_threshold_parameter;         /* C230 */
    uint32 egress_burst_cells_size_for_one_queue;            /* C231 */
    uint32 egress_burst_pkts_size_for_one_queue;             /* C232 */
    uint32 egress_burst_cells_size_for_all_ports;            /* C233 */
    uint32 egress_burst_pkts_size_for_all_ports;             /* C234 */
    uint32 egress_burst_cells_size_for_all_queues;           /* C235 */
    uint32 egress_burst_pkts_size_for_all_queues;            /* C236 */
    uint32 egress_total_use_in_cells_for_all_queues;         /* C237 */
    uint32 egress_total_use_in_pkts_for_all_queues;          /* C238 */
    uint32 egress_remaining_cells_for_all_queues;            /* C239 */
    uint32 egress_remaining_pkts_for_all_queues;             /* C240 */

}_output_port_threshold_t;

typedef struct _soc_ml_mmu_intermediate_results {
    _general_info_t           general_info;
    _input_port_threshold_t   input_port_threshold;
    _output_port_threshold_t  output_port_threshold;
}_soc_ml_mmu_intermediate_results_t;

/* Move sal_cell_func and sal_floor_func to sal_lib ? */
static uint32 sal_ceil_func(uint32 numerators , uint32 denominator)
{
    uint32  result;
    if (denominator == 0) {
        return 0xFFFFFFFF;
    }
    result = numerators / denominator;
    if (numerators % denominator != 0) {
        result++;
    }
    return result;
}

static uint32 sal_floor_func(uint32 numerators , uint32 denominator)
{
    uint32  result;
    if (denominator == 0) {
        return 0xFFFFFFFF;
    }
    result = numerators / denominator;
    return result;
}

STATIC
void _soc_ml_mmu_config_extra_queue(int unit, uint32 queue,
